Revit 2027 API
TableSectionData.SetCellStyle(Int32, Int32, TableCellStyle) Method
 Sets a cell's style
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCellStyle(
	int nRow,
	int nCol,
	TableCellStyle Style
)
Public Sub SetCellStyle (
	nRow As Integer,
	nCol As Integer,
	Style As TableCellStyle
)
public:
void SetCellStyle(
	int nRow,
	int nCol,
	TableCellStyle^ Style
)
member SetCellStyle :
        nRow : int *
        nCol : int *
        Style : TableCellStyle -> unit
Parameters
nRow Int32
nCol Int32
Style TableCellStyle
Exceptions
Exception | Condition
ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid. -or- Only allow to override cell style for header section or column header in body section.
ArgumentNullException |  A non-optional argument was null
Remarks
 For standard schedule, must set the TableCellStyleOverrideOptions in the TableCellStyle to override this cell. The global base format controls any non-overridden characteristics of this cell.
Example
public void FormatSubtitle(ViewSchedule colSchedule)
{
    TableData colTableData = colSchedule.GetTableData();
    TableSectionData tsd = colTableData.GetSectionData(SectionType.Header);
    // Subtitle is second row, first column
    if (tsd.AllowOverrideCellStyle(tsd.FirstRowNumber + 1, tsd.FirstColumnNumber))
    {
        TableCellStyle tcs = new TableCellStyle();
        TableCellStyleOverrideOptions options = new TableCellStyleOverrideOptions();
        options.FontSize = true;
        options.Bold = true;
        tcs.SetCellStyleOverrideOptions(options);
        tcs.IsFontBold = true;
        tcs.TextSize = 10;
        tsd.SetCellStyle(tsd.FirstRowNumber + 1, tsd.FirstColumnNumber, tcs);
    }
}
See Also
Reference
TableSectionData Class
SetCellStyle Overload
Autodesk.Revit.DB Namespace